XMLTest/res/raw/enc.xml

<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing"><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soapenv:mustUnderstand="1"><xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="EK-2F3909BEE23C08760913549582621151"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5" /><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=Sample Service,OU=Rampart,O=Apache,L=Colombo,ST=Western,C=LK</ds:X509IssuerName><ds:X509SerialNumber>1261391463</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>RJ79z3qRumLtSkAt2u+laHbE2DYXDTyUaizHOLomD4dhQ/qubyY2RcAj+xXxhcOTrWwgMG3hXufliIrvaoQTUkGdS5czBlzMRjSfOfqIO2B7dzF8CxnWPsi/3ndDW6gON5NK6RDD5yPmlXNUldJSTaV0T0Q1q8b38YPk2ph4+Fw=</xenc:CipherValue></xenc:CipherData><xenc:ReferenceList><xenc:DataReference URI="#ED-1" /></xenc:ReferenceList></xenc:EncryptedKey></wsse:Security><wsa:To>http://localhost:2000/axis2/services/sample05</wsa:To><wsa:MessageID>urn:uuid:1b32534f-5eb2-439b-8591-0dbc4fb55b0b</wsa:MessageID><wsa:Action>urn:echo</wsa:Action></soapenv:Header><soapenv:Body><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="ED-1" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc" /><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd" wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey"><wsse:Reference URI="#EK-2F3909BEE23C08760913549582621151" /></wsse:SecurityTokenReference></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>O8aKelmB8KGTVRGSCE8bWoGqmrFkRKlNQGFKGzTbMsOWWBhuyTNy1Ye9Vq3pHjdWLfjjKEz+jYEE/b/y1AF/Fi1fkR7Qo8rHmMpS9Zk9FXcvyU6O6vNE7GeXS8C/CwOPdh2WCI9uXljWLhIDjuZR7qAVvHXMJdNFpAL/TJ32fGUaWp/vU5SduYqXVzUA3YfLkk0SdLydsWCwbR5nKwXHsfYxR9V7JyaUVpMJ6GfRQmgh3+gY3Itol2TN0THhjrst</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></soapenv:Body></soapenv:Envelope>